In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "名前":["大沢","河合","上田"],
    "入社日":['1995-04-01','1998-07-01','2000-01-01'],
    "所属":["海外営業部","本部人事部","広島営業所"]
})
display(df1)

   名前         入社日     所属
0  大沢  1995-04-01  海外営業部
1  河合  1998-07-01  本部人事部
2  上田  2000-01-01  広島営業所

In [3]:
df2 = pd.DataFrame({
    "名前":["石川","宇田川","田坂"],
    "入社日":['1996-04-01','1996-04-01','2001-10-01'],
    "所属":["本部総務","大阪営業所","大阪営業所"]
})
display(df2)

    名前         入社日     所属
0   石川  1996-04-01   本部総務
1  宇田川  1996-04-01  大阪営業所
2   田坂  2001-10-01  大阪営業所

In [20]:
df3 = pd.DataFrame({
    "名前":["横田","和田","池田"],
    "入社日":['1998-09-01','1989-04-01','2018-04-01'],
    "所属":["本部広報","福岡営業所","北陸営業所"]
})
display(df3)

   名前         入社日     所属
0  横田  1998-09-01   本部広報
1  和田  1989-04-01  福岡営業所
2  池田  2018-04-01  北陸営業所

In [21]:
display(df1,df2,df3)

   名前         入社日     所属
0  大沢  1995-04-01  海外営業部
1  河合  1998-07-01  本部人事部
2  上田  2000-01-01  広島営業所

    名前         入社日     所属
0   石川  1996-04-01   本部総務
1  宇田川  1996-04-01  大阪営業所
2   田坂  2001-10-01  大阪営業所

   名前         入社日     所属
0  横田  1998-09-01   本部広報
1  和田  1989-04-01  福岡営業所
2  池田  2018-04-01  北陸営業所

In [22]:
pd.concat([df1,df2,df3],axis=0)

    名前         入社日     所属
0   大沢  1995-04-01  海外営業部
1   河合  1998-07-01  本部人事部
2   上田  2000-01-01  広島営業所
0   石川  1996-04-01   本部総務
1  宇田川  1996-04-01  大阪営業所
2   田坂  2001-10-01  大阪営業所
0   横田  1998-09-01   本部広報
1   和田  1989-04-01  福岡営業所
2   池田  2018-04-01  北陸営業所

In [23]:
pd.concat([df1,df2,df3],axis=0, 
          ignore_index = True)

    名前         入社日     所属
0   大沢  1995-04-01  海外営業部
1   河合  1998-07-01  本部人事部
2   上田  2000-01-01  広島営業所
3   石川  1996-04-01   本部総務
4  宇田川  1996-04-01  大阪営業所
5   田坂  2001-10-01  大阪営業所
6   横田  1998-09-01   本部広報
7   和田  1989-04-01  福岡営業所
8   池田  2018-04-01  北陸営業所

In [8]:
pd.concat([df1,df2])

    名前         入社日     所属
0   大沢  1995-04-01  海外営業部
1   河合  1998-07-01  本部人事部
2   上田  2000-01-01  広島営業所
0   石川  1996-04-01   本部総務
1  宇田川  1996-04-01  大阪営業所
2   田坂  2001-10-01  大阪営業所

In [40]:
df3

   名前         入社日     所属
0  横田  1998-09-01   本部広報
1  和田  1989-04-01  福岡営業所
2  池田  2018-04-01  北陸営業所

In [52]:
df4 = df3.set_index("名前")
display(df4)

           入社日     所属
名前
横田  1998-09-01   本部広報
和田  1989-04-01  福岡営業所
池田  2018-04-01  北陸営業所

In [42]:
df4

           入社日     所属
名前
横田  1998-09-01   本部広報
和田  1989-04-01  福岡営業所
池田  2018-04-01  北陸営業所

In [53]:
df5 = pd.DataFrame({
    "名前":["横田","和田","鈴木"],
    "役職":["執行役員","部長","係長"]
}).set_index("名前")
display(df5)

      役職
名前
横田  執行役員
和田    部長
鈴木    係長

In [50]:
df5

         役職
名前
横田  取締役執行役員
和田       部長
鈴木       係長

In [44]:
df4

           入社日     所属
名前
横田  1998-09-01   本部広報
和田  1989-04-01  福岡営業所
池田  2018-04-01  北陸営業所

In [45]:
df5

         役職
名前
横田  取締役執行役員
和田       部長
鈴木       係長

In [46]:
pd.concat([df4,df5], axis=1)

           入社日     所属       役職
名前
横田  1998-09-01   本部広報  取締役執行役員
和田  1989-04-01  福岡営業所       部長
池田  2018-04-01  北陸営業所      NaN
鈴木         NaN    NaN       係長

In [47]:
pd.concat([df4,df5], axis=1, join="outer")

           入社日     所属       役職
名前
横田  1998-09-01   本部広報  取締役執行役員
和田  1989-04-01  福岡営業所       部長
池田  2018-04-01  北陸営業所      NaN
鈴木         NaN    NaN       係長

In [48]:
pd.concat([df4,df5], axis=1, join="inner")

           入社日     所属       役職
名前
横田  1998-09-01   本部広報  取締役執行役員
和田  1989-04-01  福岡営業所       部長